app/Controllers/CentroComputoController.php

    public function addEdit($id = 0){

        $method = $this->request->getMethod();
        if($id == 0):
            $title = "Centro de computo";
            $centroComputo = ["id" => 0];
            $estados = $this->modelEstado->findAll();
            $color ="success";
            $accion = "Guardar";
            $icono = "far fa-save";
            $std = "";
        else:
            $title = "Editar centro de computo";
            $centroComputo = $this->model->find($id);
            $color ="warning";
            $accion ="Actualizar";
            $std = $this->model->estado($centroComputo['id_estado']);
            $estados = $this->modelEstado->findAll();
---
SELECT *
FROM `tbl_estado`