app/Controllers/Dashboard.php

SELECT *
FROM `tbl_usuario`
WHERE `password` = '21232f297a57a5a743894a0e4a801fc3'
 LIMIT 1
---
    public function iniciarSesion(){
        $sesion = session();
        $usuario = $this->request->getVar("username");
        $password = $this->model->where("password",md5($this->request->getVar("password")))->first();

        $data = $this->model->where("usuario",$usuario)->first();