app/Controllers/Dashboard.php

SELECT *
FROM `tbl_usuario`
WHERE `usuario` = 'diego25'
 LIMIT 1
SELECT `id`, `nombre`, `apellido`, `usuario`
FROM `tbl_usuario`
WHERE `usuario` = 'diego25'
AND `password` = '21232f297a57a5a743894a0e4a801fc3'
 LIMIT 1
---
    public function iniciarSesion(){
        $session = session();
        $user = $this->request->getVar("username");
        $password = md5($this->request->getVar("password"));

        $data = $this->model->where("usuario",$user)->first();
        $log = $this->model->select("id,nombre,apellido,usuario")->where("usuario",$user)->where("password",$password)->first();