app/Controllers/IncidenteController.php

    public function index(){
        $incidentes = $this->model->ListaIncidentes();
        $tipoIncidentes=$this->modelTipoIncidente->findAll();
        $centroComputo=$this->modelCentroComputo->findAll();
        $dispositivo=$this->modelDispositivo->findAll();
---
SELECT *
FROM `tbl_tipo_incidente`
SELECT *
FROM `tbl_centro_computo`
SELECT *
FROM `tbl_dispositivo`